<a href="https://colab.research.google.com/github/Davholl/2DPlatformer-Tutorial/blob/master/Organizando_DataFrames(Sort).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
data = [[1,2,3], [4,5,6], [7,8,9]]

In [0]:
list('321')

['3', '2', '1']

In [0]:
df = pd.DataFrame(data, list('321'), list('ZYX'))

In [0]:
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [0]:
df.sort_values(by = '3', axis=1, inplace = True)

In [0]:
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9